cmsis-svd/cmsis-svd/data/Microchip/ATSAM3AxC.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DACC</name>
      <version>6461F</version>
      <description>Digital-to-Analog Converter Controller</description>
      <prependToName>DACC_</prependToName>
      <baseAddress>0x400C8000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DACC</name>
        <value>38</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MR</name>
          <description>Mode Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRGEN</name>
              <description>Trigger Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>External trigger mode disabled. DACC in free running mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>External trigger mode enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGSEL</name>
              <description>Trigger Selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WORD</name>
              <description>Word Transfer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HALF</name>
                  <description>Half-Word transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORD</name>
                  <description>Word Transfer</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEEP</name>
              <description>Sleep Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FASTWKUP</name>
              <description>Fast Wake up Mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFRESH</name>
              <description>Refresh Period</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USER_SEL</name>
              <description>User Channel Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Channel 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Channel 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAG</name>
              <description>Tag Selection Mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Tag selection mode disabled. Using USER_SEL to select the channel for the conversion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Tag selection mode enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAXS</name>
              <description>Max Speed Mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXIMUM</name>
                  <description>Max Speed Mode enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STARTUP</name>
              <description>Startup Time Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>0 periods of DACClock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8 periods of DACClock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>16 periods of DACClock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>24 periods of DACClock</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>64 periods of DACClock</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>80</name>
                  <description>80 periods of DACClock</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>96</name>
                  <description>96 periods of DACClock</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>112</name>
                  <description>112 periods of DACClock</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512</name>
                  <description>512 periods of DACClock</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>576</name>
                  <description>576 periods of DACClock</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>640</name>
                  <description>640 periods of DACClock</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>704</name>
                  <description>704 periods of DACClock</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>768</name>
                  <description>768 periods of DACClock</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>832</name>
                  <description>832 periods of DACClock</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>896</name>
                  <description>896 periods of DACClock</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>960</name>
                  <description>960 periods of DACClock</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024</name>
                  <description>1024 periods of DACClock</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1088</name>
                  <description>1088 periods of DACClock</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1152</name>
                  <description>1152 periods of DACClock</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1216</name>
                  <description>1216 periods of DACClock</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1280</name>
                  <description>1280 periods of DACClock</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1344</name>
                  <description>1344 periods of DACClock</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1408</name>
                  <description>1408 periods of DACClock</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1472</name>
                  <description>1472 periods of DACClock</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1536</name>
                  <description>1536 periods of DACClock</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1600</name>
                  <description>1600 periods of DACClock</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1664</name>
                  <description>1664 periods of DACClock</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1728</name>
                  <description>1728 periods of DACClock</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1792</name>
                  <description>1792 periods of DACClock</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1856</name>
                  <description>1856 periods of DACClock</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1920</name>
                  <description>1920 periods of DACClock</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1984</name>
                  <description>1984 periods of DACClock</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHER</name>
          <description>Channel Enable Register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CH0</name>
              <description>Channel 0 Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH1</name>
              <description>Channel 1 Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHDR</name>
          <description>Channel Disable Register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CH0</name>
              <description>Channel 0 Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH1</name>
              <description>Channel 1 Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHSR</name>
          <description>Channel Status Register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH0</name>
              <description>Channel 0 Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1</name>
              <description>Channel 1 Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CDR</name>
          <description>Conversion Data Register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data to Convert</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>TXRDY</name>
              <description>Transmit Ready Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EOC</name>
              <description>End of Conversion Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ENDTX</name>
              <description>End of Transmit Buffer Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXBUFE</name>
              <description>Transmit Buffer Empty Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>Interrupt Disable Register</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>TXRDY</name>
              <description>Transmit Ready Interrupt Disable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EOC</name>
              <description>End of Conversion Interrupt Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ENDTX</name>
              <description>End of Transmit Buffer Interrupt Disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXBUFE</name>
              <description>Transmit Buffer Empty Interrupt Disable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>Interrupt Mask Register</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXRDY</name>
              <description>Transmit Ready Interrupt Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EOC</name>
              <description>End of Conversion Interrupt Mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENDTX</name>
              <description>End of Transmit Buffer Interrupt Mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXBUFE</name>
              <description>Transmit Buffer Empty Interrupt Mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXRDY</name>
              <description>Transmit Ready Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EOC</name>
              <description>End of Conversion Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENDTX</name>
              <description>End of DMA Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXBUFE</name>
              <description>Transmit Buffer Empty</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACR</name>
          <description>Analog Current Register</description>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IBCTLCH0</name>
              <description>Analog Output Current Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBCTLCH1</name>
              <description>Analog Output Current Control</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBCTLDACCORE</name>
              <description>Bias Current Control for DAC Core</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WPMR</name>
          <description>Write Protect Mode register</description>
          <addressOffset>0x000000E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WPEN</name>
              <description>Write Protect Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WPKEY</name>
              <description>Write Protect KEY</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
